# YOLO11n-OBB with Swin Transformer backbone
# Fixed: Matching standard YOLO11-OBB channel dimensions (256/512/1024)

# Parameters
nc: 15  # DOTA dataset classes

# Swin-YOLO architecture - adapted for OBB with correct channel dimensions
backbone:
  # Swin Transformer backbone (single output at P5/32)
  - [-1, 1, TorchVision, [768, "swin_t", "DEFAULT", True, 3, False]]  # 0: Swin-T output (768 channels, 1/32 resolution)
  
  # Build multi-scale features from single Swin output
  # P5/32 path (large objects) - MUST be 1024 channels for OBB
  - [-1, 1, Conv, [1024, 1, 1]]     # 1: Reduce channels 768->1024 (match standard YOLO11-OBB)
  - [-1, 1, SPPF, [1024, 5]]        # 2: SPPF for P5
  - [-1, 2, C2PSA, [1024]]          # 3: C2PSA attention for P5
  
  # Generate P4/16 features (medium objects) - 512 channels
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 4: Upsample to P4 scale
  - [-1, 2, C3k2, [512, False]]     # 5: Process P4 features
  
  # Generate P3/8 features (small objects) - 256 channels
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 6: Upsample to P3 scale
  - [-1, 2, C3k2, [256, False]]     # 7: Process P3 features

# YOLO11n head - PAN architecture with correct channel dimensions
head:
  # Bottom-up pathway to enhance features
  - [-1, 1, Conv, [256, 3, 2]]      # 8: Downsample P3 to P4 scale
  - [[-1, 5], 1, Concat, [1]]       # 9: Concat with P4 (layer 5): 256+512=768
  - [-1, 2, C3k2, [512, False]]     # 10: Enhanced P4 (P4/16-medium) -> 512 channels

  - [-1, 1, Conv, [512, 3, 2]]      # 11: Downsample P4 to P5 scale
  - [[-1, 3], 1, Concat, [1]]       # 12: Concat with P5 (layer 3): 512+1024=1536
  - [-1, 2, C3k2, [1024, True]]     # 13: Enhanced P5 (P5/32-large) -> 1024 channels

  - [[7, 10, 13], 1, OBB, [nc, 1]]  # 14: OBB heads (P3:256, P4:512, P5:1024)